org/roam/guix.org
:PROPERTIES:
:ID:       4e76d981-fd7c-43b0-9d8c-120386135729
:END:
#+title: guix
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t

* Guix
** Link manifest
#+NAME: link-guix-el
#+BEGIN_SRC elisp :tangle guix.sh :shebang "\":\"; emacs -Q --script guix.sh -- $@ $args ; exit $? # -*- mode: emacs-lisp; lexical-binding: t; -*-"
(ignore-errors
(let* ((manifest-dir (file-name-as-directory (concat (file-name-as-directory (xdg-config-home)) "guix-manifests")))
        (manifest-dir-file (concat manifest-dir "user.scm")))
    (if (not (file-exists-p manifest-dir))
        (make-directory manifest-dir))
    (if (not (or (file-exists-p manifest-dir-file) (file-symlink-p manifest-dir-file)))
        (make-symbolic-link (concat (file-name-directory (or load-file-name buffer-file-name)) "user.scm") manifest-dir-file 1))))
#+END_SRC
** User manifest
#+NAME: manifest-scm
#+BEGIN_SRC scheme :tangle user.scm
  ;; Manifest for development env
  (specifications->manifest
   '(
     ;; basic
     ;;"shepherd" ;;"glibc-utf8-locales"

     ;;"ungoogled-chromium-nvda"
     ;;"firefox-nvda"; --with-graft=mesa=nvda
     ;;"torbrowser"

     ;;"transmission"
     ;;"nzbget"
     ;;"steam-nvidia" ;; steam
     ;;"zfs"
     "strace"
     "perf"
     "flamegraph"
     "bpftrace"
     "bcc"

     ;; C dev
     ;;"make" ;;"cmake"
     ;;"glibc" ;; "musl"
     ;;"gcc-toolchain" ;;"clang-toolchain"
     "gdb" ;;"lldb"
     ;;"rr"
     ;;"binutils"
     ;;"module-init-tools"
     ;;"msr-tools"

     ;; java
     ;;"openjdk"
     ;;"maven"
     ;;"leiningen"
     ;;"clojure"

     ;; julia
     ;;"julia"

     ;; python
     ;;"python"
     ;;"vapoursynth";; "ffms2"

     ;; shell
     ;;"shellcheck" ;;"bash"
     "htop"; Requires CAP_NET_ADMIN for PERCENT_*_DELAY
     ;;"bottom"
     ;;"xclip"
     ;;"wl-clipboard"
     ;;"bc"
     ;;"jq"
     ;;"coreutils" ;;"busybox"
     ;;"less"
     ;;"gzip"
     ;;"fdisk" ;;"gparted"
     ;;"wget"
     ;;"diffutils"
     ;;"findutils"
     ;;"tar"
     ;;"gawk"
     ;;"which"
     ;;"sed"
     ;;"grep"
     ;;"patch"
     ;;"gash"
     ;;"gash-utils"
     "screen"

     ;; apps
     ;;"wine64"; "wine"
     ;;"winetricks"
     ;;"clamav"
     ;;"filezilla"
     ;;"lynx"
     ;;"libvirt"
     ;;"virt-manager"
     ;;"postgresql"
     ;;"sqlite"
     ;;"tigervnc-client"
     ;;"tigervnc-server" ; newer gdm supports rdp login
     ;;"searx"
     ;;"gnuradio"
     ;;"obs"
     ;;"virt-viewer"
     ;;"dino" ; xmpp client
     ;;"flatpak"
     ;;"waypipe"

     ;; docs
     ;;"libreoffice"
     ;;"calibre"
     ;;"biber"
     ;;"texlive"
     ;;"kiwix-desktop"

     ;; media
     ;;"blender"
     ;;"gimp"
     ;;"inkscape"
     ;;"vlc"
     ;;"mkvtoolnix"
     ;;"mediainfo"
     ;;"ffmpeg"
     ;;"gnuplot"
     ;;"makemkv"
     ;;"yt-dlp"

     ;; net
     ;;"curl"
     ;;"whois"
     ;;"bind:utils"
     ;;"nmap"
     ;;"python-stem"
     ;;"onionshare"
     ;;"iptables"
     ;;"ebtables"
     ;;"wireshark"
     ;;"netcat"
     ;;"net-tools"
     ;;"openssh" ;;"dropbear"
     ;;"wireguard-tools"
     ;;"socat"
     ;;"tor"
     ;;"torsocks"
     ;;"i2pd"
     ;;"dnsmasq"

     ;; Desktop
     ;;"notification-daemon"
     ;;"nvidia-driver"
     ))
#+END_SRC
