docs/guix.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>guix</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org0c41d30">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>

<div id="outline-container-orgb4eaa13" class="outline-2">
<h2 id="orgb4eaa13">Guix</h2>
<div class="outline-text-2" id="text-orgb4eaa13">
</div>
<div id="outline-container-orgcd93e65" class="outline-3">
<h3 id="orgcd93e65">Link manifest</h3>
<div class="outline-text-3" id="text-orgcd93e65">
<div class="org-src-container">
<pre class="src src-elisp" id="org35a9f45">(ignore-errors
(let* ((manifest-dir (file-name-as-directory (concat (file-name-as-directory (xdg-config-home)) "guix-manifests")))
        (manifest-dir-file (concat manifest-dir "user.scm")))
    (if (not (file-exists-p manifest-dir))
        (make-directory manifest-dir))
    (if (not (or (file-exists-p manifest-dir-file) (file-symlink-p manifest-dir-file)))
        (make-symbolic-link (concat (file-name-directory (or load-file-name buffer-file-name)) "user.scm") manifest-dir-file 1))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org947d138" class="outline-3">
<h3 id="org947d138">User manifest</h3>
<div class="outline-text-3" id="text-org947d138">
<div class="org-src-container">
<pre class="src src-scheme" id="org876f218">;; Manifest for development env
(specifications-&gt;manifest
 '(
   ;; basic
   ;;"shepherd" ;;"glibc-utf8-locales"

   ;;"ungoogled-chromium-nvda"
   ;;"firefox-nvda"; --with-graft=mesa=nvda
   ;;"torbrowser"

   ;;"transmission"
   ;;"nzbget"
   ;;"steam-nvidia" ;; steam
   ;;"zfs"
   "perf"
   "bpftrace"
   "bcc"

   ;; C dev
   ;;"make" ;;"cmake"
   ;;"glibc" ;; "musl"
   ;;"gcc-toolchain" ;;"clang-toolchain"
   ;;"gdb" ;;"lldb"
   "rr"
   ;;"binutils"
   ;;"module-init-tools"
   ;;"msr-tools"

   ;; java
   ;;"openjdk"
   ;;"maven"
   ;;"leiningen"
   ;;"clojure"

   ;; julia
   ;;"julia"

   ;; python
   ;;"python"

   ;; shell
   ;;"shellcheck" ;;"bash"
   "htop"
   ;;"xclip"
   ;;"wl-clipboard"
   ;;"bc"
   ;;"jq"
   ;;"coreutils" ;;"busybox"
   ;;"less"
   ;;"gzip"
   ;;"fdisk" ;;"gparted"
   ;;"wget"
   ;;"diffutils"
   ;;"findutils"
   ;;"tar"
   ;;"gawk"
   ;;"which"
   ;;"sed"
   ;;"grep"
   ;;"patch"
   ;;"gash"
   ;;"gash-utils"

   ;; apps
   ;;"wine64"; "wine"
   ;;"winetricks"
   ;;"clamav"
   ;;"filezilla"
   ;;"lynx"
   ;;"libvirt"
   ;;"virt-manager"
   ;;"postgresql"
   ;;"sqlite"
   ;;"tigervnc-client"
   ;;"tigervnc-server" ; newer gdm supports rdp login
   ;;"searx"
   ;;"gnuradio"
   ;;"obs"
   ;;"virt-viewer"
   ;;"dino" ; xmpp client
   ;;"flatpak"

   ;; docs
   ;;"libreoffice"
   ;;"calibre"
   ;;"biber"
   ;;"texlive"
   ;;"kiwix-desktop"

   ;; media
   ;;"blender"
   ;;"gimp"
   ;;"inkscape"
   ;;"vlc"
   ;;"mkvtoolnix"
   ;;"mediainfo"
   ;;"ffmpeg"
   ;;"gnuplot"
   ;;"makemkv"
   "flamegraph"
   ;;"yt-dlp"
   ;;"vapoursynth";; "ffms2"

   ;; net
   ;;"curl"
   ;;"whois"
   ;;"bind:utils"
   ;;"nmap"
   ;;"python-stem"
   ;;"onionshare"
   ;;"iptables"
   ;;"ebtables"
   "wireshark"
   ;;"netcat"
   ;;"net-tools"
   ;;"openssh" ;;"dropbear"
   ;;"wireguard-tools"
   ;;"socat"
   "strace"
   ;;"tor"
   "torsocks"
   ;;"i2pd"
   ;;"screen"
   "dnsmasq"

   ;; Desktop
   ;;"notification-daemon"
   ;;"nvidia-driver"
   ))
</pre>
</div>
</div>
</div>
