docs/guix.html
<div id="outline-container-org761e1f5" class="outline-3">
<h3 id="org761e1f5">guix notes</h3>
<div class="outline-text-3" id="text-org761e1f5">
<ul class="org-ul">
<li><a href="https://git.genenetwork.org/guix-north-america/about/">https://git.genenetwork.org/guix-north-america/about/</a> for NA substitute server ?</li>
<li>cuirass ci saves gc roots in <code>/var/guix/gcroots/profiles/per-user/cuirass/cuirass</code> for default of 30 days
<ul class="org-ul">
<li>can unlink and gc for space</li>
</ul></li>
<li><code>guix system image -t iso9660 ./installer.scm</code></li>
<li><code>GUIX_SANDBOX_EXTRA_MOUNTS=/path/to/extra/thing</code> for guix steam</li>
<li>transform options for source, c-toolchain, debug, grafts/inputs
<ul class="org-ul">
<li><code>--with-commit=SomeSuchPackage=XXX</code></li>
</ul></li>
<li><code>-L ./guix-channel</code> to use local channel changes</li>
<li><code>guix pack -S /bin=bin -S /sbin=sbin --localstatedir -RR guix bash-static</code></li>
<li><code>guix package --roll-back</code> to drop to last version</li>
<li>commit signing and downgrading flags are <code>--disable-authentication --allow-downgrades</code></li>
<li>platform specific binaries can be produces with the <code>--tune</code> flag</li>
<li>hpc channel for extra pytorch packages
<ul class="org-ul">
<li><a href="https://gitlab.inria.fr/guix-hpc/guix-hpc/">https://gitlab.inria.fr/guix-hpc/guix-hpc/</a></li>
<li>misc channels <a href="https://git.sr.ht/~whereiseveryone/toys/log">https://git.sr.ht/~whereiseveryone/toys/log</a></li>
</ul></li>
<li>non root guix can be done through a series of env variables and flags
<ul class="org-ul">
<li>arg <code>--listen=/socket</code> and/or env vars</li>
</ul></li>
<li>app img run <code>mount thing.AppImage tmpmnt -o offset=$(guix shell -C -F zlib -- "./thing.AppImage --appimage-offset")</code></li>
<li>guix shell can emulate normal fs with &#x2013;emulate-fhs</li>
<li>set package as GC root with <code>ln --symbolic --force /path/to/guix/packagelink /var/guix/gcroots</code> for guix copy</li>
<li>download source with <code>guix build -S PKG</code></li>
<li>search with <code>rg -a -z "STR" /gnu/store/PKG.tar.gz</code>
<ul class="org-ul">
<li>Add <code>$XDG_DATA_HOME/guix/bin</code> to <code>$PATH</code></li>
<li><code>--disable-chroot</code></li>
</ul></li>
<li>default source for user is <code>$HOME/.guix-profile/etc/profile</code> and <code>$XDG_CONFIG_HOME/guix/etc/profile</code>
<ul class="org-ul">
<li>cleanup space with <code>guix package -d &amp;&amp; guix pull -d &amp;&amp; guix gc</code></li>
<li>os templates for qemu images with <code>guix system image -t qcow2 --save-provenance</code>
<ul class="org-ul">
<li>guix system upgrade
<ul class="org-ul">
<li><code>ln -s /etc/channels.scm ~/.config/guix/channels.scm</code></li>
<li><code>guix pull</code> <code>. ~/.config/guix/current/etc/profile</code></li>
<li><code>sudo -E guix system reconfigure /etc/guix-os.scm</code></li>
</ul></li>
<li>run guix vm
<ul class="org-ul">
<li><code>qemu-system-x86_64 -nic user,model=virtio-net-pci,hostfwd=tcp::10022-:22 -enable-kvm -m 1024 -device virtio-blk,drive=myhd -drive if=none,file=$MY_IMAGE,id=myhd -spice port=5930,disable-ticketing</code></li>
</ul></li>
<li>grow vm disk
<ul class="org-ul">
<li><code>qemu-image resize IMAGE.qcow2 +10G</code></li>
<li><code>growpart /dev/vda 2</code></li>
<li><code>resize2fs /dev/vda2</code></li>
</ul></li>
</ul></li>
<li><code>guix hash -xr .</code> for the checksum of a repo</li>
<li><code>guix publish</code> substitutes after exporting/importing key with <code>guix archive</code> or use nars with <code>guix archive --export -r</code></li>
</ul></li>
<li>packages are standard SRFI-9 guile records (set-fields, etc&#x2026;)</li>
<li>nonguix substitutes at <code>substitutes.nonguix.org</code> key is <code>/signing-key.pub</code>.</li>
<li><code>guix time-machine --commit=a4eae0c3adce8e4c4ac153a4959d18b9897a67e1 -- package -i old</code></li>
<li>manual setup</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell" id="orgdd3efa1">#https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh
# get tarball for system=x86_64-linux,aarch64,armhf,i686
wget https://ftp.gnu.org/gnu/guix/guix-binary-1.0.1.x86_64-linux.tar.xz
# check sig
wget https://sv.gnu.org/people/viewgpg.php?user_id=15145 -qO - | gpg --import
wget https://ftp.gnu.org/gnu/guix/guix-binary-1.0.1.x86_64-linux.tar.xz.sig
gpg --verify guix-binary-1.0.1.x86_64-linux.tar.xz.sig
# with root
sudo -i
# untar into dirs
tar --warning=no-timestamp -xf /path/to/guix-binary-1.0.1.x86_64-linux.tar.xz
mv var/guix /var/ &amp;&amp; mv gnu /
# add guix profile
mkdir -p ~root/.config/guix
ln -sf /var/guix/profiles/per-user/root/current-guix ~root/.config/guix/current
# setup build daemon for multiple users
cp ~root/.config/guix/current/lib/systemd/system/guix-daemon.service /etc/systemd/system/
# add build users
groupadd --system guixbuild
for i in `seq -w 1 10`;
do
    useradd -g guixbuild -G guixbuild           \
            -d /var/empty -s `which nologin`    \
            -c "Guix build user $i" --system    \
            guixbuilder$i;
done
# link guix and info for all users
mkdir -p /usr/local/bin
cd /usr/local/bin
ln -s /var/guix/profiles/per-user/root/current-guix/bin/guix
mkdir -p /usr/local/share/info
cd /usr/local/share/info
for i in /var/guix/profiles/per-user/root/current-guix/share/info/* ;
do ln -s $i ; done
# source guix profile and add sub servers
source ~/root/.config/guix/current/etc/profile
guix archive --authorize &lt; ~root/.config/guix/current/share/guix/ci.guix.gnu.org.pub
guix archive --authorize &lt; ~root/.config/guix/current/share/guix/bordeaux.guix.gnu.org.pub
# install locale
guix package -i glibc-utf8-locales
</pre>
</div>
<ul class="org-ul">
<li>manual install
<ul class="org-ul">
<li>create wifi.conf with</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-conf" id="org9141850">network={
  ssid="ssid-name"
  key_mgmt=WPA-PSK
  psk="unencrypted passphrase"
}
</pre>
</div>
<ul class="org-ul">
<li><code>rfkill unblock all &amp;&amp; ifconfig -a &amp;&amp; wpa_supplicant -c wifi.conf -i INTERFACE -B &amp;&amp; dhclient -v INTERFACE</code></li>
<li>partition with <code>lsblk &amp;&amp; cfdisk</code></li>
<li>format with mkfs</li>
<li>mount root as mnt and <code>/boot/efi</code> under <code>/mnt/boot/efi</code></li>
<li>swapon the device</li>
<li><code>herd start cow-store /mnt</code></li>
<li>clone config, symlink channels, pull then <code>guix system -L CONFIG_DIR init config.scm /mnt</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh" id="org2631d8f">guix shell --container --network --emulate-fhs \
    --development ungoogled-chromium gcc:lib \
    --preserve='^DISPLAY$' \
    --preserve='^XAUTHORITY$' --expose=$XAUTHORITY \
    --preserve='^DBUS_' --expose=/var/run/dbus \
    --expose=/sys/dev --expose=/sys/devices --expose=/dev/dri \
    -- ./VSCodium-1.74.0.22342.glibc2.17-x86_64.AppImage --appimage-extract-and-run # Run VSCodium Appimage

guix shell --network --container --emulate-fhs \
    bash coreutils curl grep nss-certs gcc:lib gcc-toolchain \
    pkg-config glib cairo atk pango@1.48.10 gdk-pixbuf gtk+ git \
    --share=$HOME/temphome=$HOME --no-cwd

curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh # install rustup in guix

guix shell --container --network --emulate-fhs \
    --preserve='^DISPLAY$' \
    --preserve='^XAUTHORITY$' --expose=$XAUTHORITY \
    alsa-lib bash coreutils dbus-glib file gcc:lib \
    grep gtk+ libcxx pciutils sed \
    -- ./start-tor-browser.desktop -v ; # Start tor-browser
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="orgf3fecd7">GUIX_DAEMON_SOCKET=$XDG_DATA_HOME/guix/var/guix/daemon-socket/socket
GUIX_DATABASE_DIRECTORY=$XDG_DATA_HOME/guix/var/guix/db
GUIX_LOG_DIRECTORY=$XDG_DATA_HOME/guix/var/log/guix
GUIX_STATE_DIRECTORY=$XDG_DATA_HOME/guix/var/guix
GUIX_CONFIGURATION_DIRECTORY=$XDG_CONFIG_HOME/guix/etc
GUIX_LOCPATH=$XDG_DATA_HOME/guix/var/guix/profiles/per-user/root/guix-profile/lib/locale
NIX_STORE=$XDG_DATA_HOME/guix/gnu/store
</pre>
</div>
</div>
</div>
