docs/guix.html

<div id="outline-container-orge4d6122" class="outline-3">
<h3 id="orge4d6122">guix issues</h3>
<div class="outline-text-3" id="text-orge4d6122">
</div>
<div id="outline-container-orgcf16313" class="outline-4">
<h4 id="orgcf16313"><span class="todo TODO">TODO</span> [PATCH v1] initrd: Allow extra search paths with ‘initrd-extra-module-paths’&#xa0;&#xa0;&#xa0;<span class="tag"><span class="patch">patch</span></span></h4>
<div class="outline-text-4" id="text-orgcf16313">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-05-02 Mon] </span></span> Submitted
</p>
<p>
:DEBBUGS<sub>ID</sub>: 55231
:CREATOR: Brian Cully &lt;bjc@spork.org&gt;
</p>
<p>
<a href="(progn (debbugs-org-mode 1) (debbugs-gnu-select-report))">Messages</a>
<span class="timestamp-wrapper"><span class="timestamp">[2022-06-21 Tue] </span></span> Last modified
</p>
</div>
</div>

<div id="outline-container-orgfab93e1" class="outline-4">
<h4 id="orgfab93e1"><span class="todo TODO">TODO</span> Add support for file capabilities(7)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="patch">patch</span></span></h4>
<div class="outline-text-4" id="text-orgfab93e1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-02-12 Sun] </span></span> Submitted
</p>
<p>
:DEBBUGS<sub>ID</sub>: 61462
:CREATOR: Tobias Geerinckx-Rice &lt;me@tobias.gr&gt;
</p>
<p>
<a href="(debbugs-gnu-select-report)">Messages</a>
<span class="timestamp-wrapper"><span class="timestamp">[2023-12-23 Sat] </span></span> Last modified
</p>

<div class="org-src-container">
<pre class="src src-scheme" id="orgea7be22">; WIP This does not work as it can't find patches? (ghostscript)
(define-module (etc httm-manifest)
 #:use-module (guix scripts pack)
 #:use-module (guix gexp)
 #:use-module (guix monads)
 #:use-module (guix profiles)
 #:use-module (guix store)
 #:use-module (guix derivations)
 #:use-module (guix modules)
 #:use-module (gnu packages)
 #:use-module (gnu packages gnupg)
 #:use-module (gnu packages guile)
 #:use-module (gnu packages ghostscript)

 )

;(display (source-module-closure '((guix scripts pack)
;                                  (guix monads)
;                                  (guix profiles)
;                                  (guix store)
;                                  (guix derivations))))

  (manifest
   (list
    (manifest-entry
     (name "httm-binary-tarball")
     (version "0.30.0")
     (item (computed-file "httm-directory"
                          (with-extensions (list guile-gcrypt guile-zlib guile-git guile-bytestructures guile-json-4)
                                           (with-imported-modules (source-module-closure
                                                                   '(;(guix packages)
                                                                     ;(guix utils)
                                                                     ;(gnu compression)
                                                                     ;(gnu packages ghostscript)
                                                                     ;(gnu packages)
                                                                     (guix scripts pack)
                                                                     (guix monads)
                                                                     (guix profiles)
                                                                     (guix store)
                                                                     (guix derivations))
                                                                   ;(append %load-path (%patch-path)); load-path
                                                                   )
                          #~(let ((bin (string-append #$output "/bin")))
                              (mkdir #$output) (mkdir bin)
                              (use-modules ;(guix packages)
                                           ;(guix gexp)
                                           ;(guix utils)
                                           ;(gnu compression)
                                           ;(gnu packages ghostscript)
                                           ;(gnu packages)
                                           (guix scripts pack)
                                           (guix monads)
                                           (guix profiles)
                                           (guix store)
                                           (guix derivations))
                              (define (build-tarballs)
                                (run-with-store (open-connection)
                                                (mbegin %store-monad
                                                        ;(set-guile-for-build (default-guile))
                                                        (&gt;&gt;= (profile-derivation (packages-&gt;manifest (list "rust-httm-0.30")))
                                                             (lambda (profile)
                                                               (self-contained-tarball "httm-binary" profile
                                                                                       #:profile-name "rust-httm"
                                                                                      ;#:localstatedir? #t
                                                                                      ;#:compressor (lookup-compressor "xz")
                                                                                       ))))
                                                #:system "x86_64-linux"))
                              (symlink (derivation-&gt;output-path (build-tarballs)) (string-append bin "rust-httm.tar.xz"))))))))))

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
